Revit 2027 API
FieldBuilder.NeedsSubSchemaGUID Method
 Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool NeedsSubSchemaGUID()
Public Function NeedsSubSchemaGUID As Boolean
public:
bool NeedsSubSchemaGUID()
member NeedsSubSchemaGUID : unit -> bool
Return Value
Boolean
 True if SubSchemaGUID is required.
See Also
Reference
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace